Revit 2027 API
IFCData.CreateLogicalOfType Method
 Creates a logical data object of the specified type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateLogicalOfType(
	IFCLogical value,
	string typeName
)
Public Shared Function CreateLogicalOfType (
	value As IFCLogical,
	typeName As String
) As IFCData
public:
static IFCData^ CreateLogicalOfType(
	IFCLogical value,
	String^ typeName
)
static member CreateLogicalOfType :
        value : IFCLogical *
        typeName : string -> IFCData
Parameters
value IFCLogical
 The IFCLogical value.
typeName String
 The type name.
Return Value
IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace